public class Main {
    public static void main(String[] args) {

    }
}
/*
    Написати програму для виведення на екран частини XML документу за допомогою
SAX парсеру без валідації для вивчення його структури та вмісту; програмно отримати
перелік всіх тегів, імена яких присутні в документі. done
    За невеликим характерним фрагментом скласти xsd схему документу, створити
валідатор та перевірити, чи правильно було зрозуміло структуру документу. done
    Написати програмне рішення, що за допомогою SAX парсеру без валідації отримає
назви всіх національних груп, що представлені в документі.
    Написати додаток, що з всього XML документу вибирає задану кількість найбільш
популярних імен в заданій етнічній групі із зберіганням інформації про: ім’я, гендер,
кількість імен та рейтинг імен, а також створює відповідні Java об’єкти для зберігання
цієї інформації та сортує інформацію по збільшенню номеру в рейтингу. Зберегти вибрану та відсортовану інформацію до нового XML файлу за допомогою DOM
парсеру.
    Прочитати цей новий документ за допомогою DOM парсеру та вивести інформацію,
що в ньому зберігається, на екран.
*/